app/controllers/scores_controller.rb

  def index
    @scores = Score.all
---
SELECT "scores".* FROM "scores"

  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "hello"], ["point", 12], ["grade", "A"], ["student_id", 1], ["created_at", "2022-09-29 10:17:41.173412"], ["updated_at", "2022-09-29 10:17:41.173412"]]

  def update
    respond_to do |format|
      if @score.update(score_params)
---
UPDATE "scores" SET "grade" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["grade", "B"], ["updated_at", "2022-09-22 07:35:58.829863"], ["id", 1]]

  def destroy
    @score.destroy
---
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 24]]

    def set_score
      @score = Score.find(params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]