app/controllers/students_controller.rb

  def edit_score
      @scores = Score.where(student_id: params[:id])
      total_score = 0
      max_score = 0
      @most_score = '-'
      @scores.each do |score|
---
SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "dob", "student_no", "class_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["dob", "2221-03-04"], ["student_no", "2131234"], ["class_year", 1002], ["created_at", "2022-09-22 07:10:49.857945"], ["updated_at", "2022-09-22 07:10:49.857945"]]